// Задача 25. Напишите цикл, который на вход принимает два числа (A) и (B) и возводит число А в степень В

// System.Console.WriteLine(" Введите число А ");
// int A = Convert.ToInt32(System.Console.ReadLine());

// System.Console.WriteLine(" Введите число В ");
// int B = Convert.ToInt32(System.Console.ReadLine()); 
// int result = 1;
// void getSqrt()
// {
//     for (int i = 1; i <= B; i++)
//     {
//         result = result*A;
//         System.Console.Write(result+ " ");
//     }
// }
// getSqrt();


// Задача 27. Напишите программу, которая принимает на вход число и выдает сумму цифр в нем

// System.Console.WriteLine(" Введите число ");
// int num = Convert.ToInt32(System.Console.ReadLine());
// int result = 0;
// int A = 0;
// void sum()
// {
//     while (num >= 1 )
//     {
//         A = num%10;
//         System.Console.Write(A+ " ");
//         num = num/10;
//         System.Console.Write(num+ " ");
//         result+=A;
//     }
//     System.Console.WriteLine(result);
// }
// sum();



// Задача 29. Напишите программу, которая задает массив из 8 элементов и выводит их на экран 

// void getArray()
// {
//     int [] Array = new int [8];
//     for (int i = 0; i < Array.Length; i++)
//      {
//          Array[i] = new Random().Next(0,300);
//          System.Console.Write(Array[i] + " ");
// }
// }
// getArray();